//Завдання 1
//Напишіть програму з трьома класами - автомат, магазин, набій.
//Кожен набій пронумерований(нумерація послідовна і при запуску програми починається
//	з випадкового числа) і вміє вистрілювати і влучати в мішень з імовірністю 70 % .Кожен
//	набій у програмі має унікальний номер.
//	Магазин реалізований у вигляді стеку, містить 30 набоїв і вміє :
//o заряджати набій(отримує його & quot; готовим & quot;)
//o віддавати набій(верхній)
//Автомат вміє :
//o прийняти магазин(тобто можна змінювати магазини у автоматі)
//o стріляти - попросити магазин дати 1 набій, і, якщо дав, попросити набій вистрелити
//(набій при цьому скаже, чи влучив, а автомат передасть результат& quot; нагору& quot; )
//При пострілі в консоль має виводитись повідомлення такого типу :
//Автомат вистрелив кулю 5, і промахнувся.
//Автомат вистрелив кулю 6, і влучив.
#include"Avtomat.h"
int main() {
	srand(unsigned(time(NULL)));
	Avtomat one;

	one.Fire();
	one.Fire();
	one.Fire();
	cout << "Set magazine" << endl;
	one.Set_magazin();
	one.Fire();
	one.Fire();
	one.Fire();
	one.Fire();
	one.Fire();
	one.Fire();
	one.Fire();
	one.Fire();

	system("pause");
	return 0;
}